In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import os

In [2]:
base_path = "E:/AI and ML/AI and ML projects/Fraud_detection/notebooks/Fraud_dataset/Data"


# Customer
customer_data = pd.read_csv(os.path.join(base_path, "Customer Profiles", "customer_data.csv"))
account_activity = pd.read_csv(os.path.join(base_path, "Customer Profiles", "account_activity.csv"))


# Transactions (BASE)
transaction_records = pd.read_csv(os.path.join(base_path, "Transaction Data", "transaction_records.csv"))
transaction_metadata = pd.read_csv(os.path.join(base_path, "Transaction Data", "transaction_metadata.csv"))

# Merchant
merchant_data = pd.read_csv(os.path.join(base_path, "Merchant Information", "merchant_data.csv"))
category_labels = pd.read_csv(os.path.join(base_path, "Merchant Information", "transaction_category_labels.csv"))

# Amounts
amount_data = pd.read_csv(os.path.join(base_path, "Transaction Amounts", "amount_data.csv"))
anomaly_scores = pd.read_csv(os.path.join(base_path, "Transaction Amounts", "anomaly_scores.csv"))

# Fraud labels
fraud_indicators = pd.read_csv(os.path.join(base_path, "Fraudulent Patterns", "fraud_indicators.csv"))
suspicious_activity = pd.read_csv(os.path.join(base_path, "Fraudulent Patterns", "suspicious_activity.csv"))

# Customer Table

In [3]:
customer_data.head()

   CustomerID           Name  Age       Address
0        1001  Customer 1001   54  Address 1001
1        1002  Customer 1002   35  Address 1002
2        1003  Customer 1003   40  Address 1003
3        1004  Customer 1004   30  Address 1004
4        1005  Customer 1005   46  Address 1005

In [4]:
customer_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerID  1000 non-null   int64
 1   Name        1000 non-null   object
 2   Age         1000 non-null   int64
 3   Address     1000 non-null   object
dtypes: int64(2), object(2)
memory usage: 31.4+ KB

In [5]:
account_activity.head()

   CustomerID  AccountBalance   LastLogin
0        1001     9507.272060  2022-01-01
1        1002     7408.704536  2022-01-02
2        1003     1715.321989  2022-01-03
3        1004     3101.509134  2022-01-04
4        1005     5405.766914  2022-01-05

In [6]:
customer_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   CustomerID  1000 non-null   int64
 1   Name        1000 non-null   object
 2   Age         1000 non-null   int64
 3   Address     1000 non-null   object
dtypes: int64(2), object(2)
memory usage: 31.4+ KB

# Transactions (BASE) Table

In [7]:
transaction_records.head()

   TransactionID     Amount  CustomerID
0              1  55.530334        1952
1              2  12.881180        1027
2              3  50.176322        1955
3              4  41.634001        1796
4              5  78.122853        1946

In [8]:
transaction_metadata.head()

   TransactionID            Timestamp  MerchantID
0              1  2022-01-01 00:00:00        2701
1              2  2022-01-01 01:00:00        2070
2              3  2022-01-01 02:00:00        2238
3              4  2022-01-01 03:00:00        2879
4              5  2022-01-01 04:00:00        2966

# Merchant Table

In [9]:
merchant_data.head()

   MerchantID   MerchantName       Location
0        2001  Merchant 2001  Location 2001
1        2002  Merchant 2002  Location 2002
2        2003  Merchant 2003  Location 2003
3        2004  Merchant 2004  Location 2004
4        2005  Merchant 2005  Location 2005

In [10]:
category_labels.head()

   TransactionID Category
0              1    Other
1              2   Online
2              3   Travel
3              4   Travel
4              5    Other

# Amounts Tables

In [11]:
amount_data.head()

   TransactionID  TransactionAmount
0              1          79.413607
1              2          12.053087
2              3          33.310357
3              4          46.121117
4              5          54.051618

In [12]:
anomaly_scores.head()

   TransactionID  AnomalyScore
0              1      0.686699
1              2      0.081749
2              3      0.023857
3              4      0.876994
4              5      0.034059

# Fraud labels Table

In [13]:
fraud_indicators.head()

   TransactionID  FraudIndicator
0              1               0
1              2               0
2              3               0
3              4               0
4              5               0

In [14]:
suspicious_activity.head()

   CustomerID  SuspiciousFlag
0        1001               0
1        1002               0
2        1003               0
3        1004               0
4        1005               0

In [15]:
data_tables = [customer_data, account_activity, transaction_records, transaction_metadata, merchant_data, category_labels, amount_data, anomaly_scores, fraud_indicators, suspicious_activity]
name_tables = ["customer_data", "account_activity", "transaction_records", "transaction_metadata", "merchant_data", "category_labels", "amount_data", "anomaly_scores", "fraud_indicators", "suspicious_activity"]

def  tables_name():
    table_names = ["Customer", "Transactions (BASE)", "Merchant" , "Amounts","Fraud labels"]
    for name in table_names:
        yield name
name = tables_name()
for i in range(len(data_tables)):

    if i%2 == 0:
        print("-"*100)
        print(next(name))
        print()
    print(name_tables[i])
    display(data_tables[i].columns)
    print()

----------------------------------------------------------------------------------------------------
Customer

customer_data

Index(['CustomerID', 'Name', 'Age', 'Address'], dtype='object')

account_activity

Index(['CustomerID', 'AccountBalance', 'LastLogin'], dtype='object')

----------------------------------------------------------------------------------------------------
Transactions (BASE)

transaction_records

Index(['TransactionID', 'Amount', 'CustomerID'], dtype='object')

transaction_metadata

Index(['TransactionID', 'Timestamp', 'MerchantID'], dtype='object')

----------------------------------------------------------------------------------------------------
Merchant

merchant_data

Index(['MerchantID', 'MerchantName', 'Location'], dtype='object')

category_labels

Index(['TransactionID', 'Category'], dtype='object')

----------------------------------------------------------------------------------------------------
Amounts

amount_data

Index(['TransactionID', 'TransactionAmount'], dtype='object')

anomaly_scores

Index(['TransactionID', 'AnomalyScore'], dtype='object')

----------------------------------------------------------------------------------------------------
Fraud labels

fraud_indicators

Index(['TransactionID', 'FraudIndicator'], dtype='object')

suspicious_activity

Index(['CustomerID', 'SuspiciousFlag'], dtype='object')

# Final Relationship Summary (Very Important)

customer_data (CustomerID)  ‚Üê‚îÄ‚îÄ account_activity
        ‚Üë
        ‚îî‚îÄ‚îÄ transaction_records (TransactionID, CustomerID)
                  ‚Üë
                  ‚îú‚îÄ‚îÄ transaction_metadata
                  ‚îú‚îÄ‚îÄ category_labels
                  ‚îú‚îÄ‚îÄ amount_data
                  ‚îú‚îÄ‚îÄ anomaly_scores
                  ‚îî‚îÄ‚îÄ fraud_indicators
                           ‚Üì
                    merchant_data (MerchantID)

# For fraud detection, your EDA goal is to answer:

* ‚ÄúHow are fraudulent transactions different from normal ones?‚Äù

# Merging The Tables Based on Primary Keys, Forign Keys

## üß© Step 1 ‚Äî Start with BASE TABLE

In [16]:
df = transaction_records.copy()

In [17]:
df.head(2)

   TransactionID     Amount  CustomerID
0              1  55.530334        1952
1              2  12.881180        1027

## üß© Step 2 ‚Äî Merge TARGET FIRST (mandatory)

In [18]:
fraud_indicators.head(2)

   TransactionID  FraudIndicator
0              1               0
1              2               0

In [19]:
df = df.merge(fraud_indicators, on = "TransactionID", how = "left")

In [20]:
df.head(2)

   TransactionID     Amount  CustomerID  FraudIndicator
0              1  55.530334        1952               0
1              2  12.881180        1027               0

## üß© Step 3 ‚Äî Merge transaction-level tables

In [21]:
transaction_metadata.head(2)

   TransactionID            Timestamp  MerchantID
0              1  2022-01-01 00:00:00        2701
1              2  2022-01-01 01:00:00        2070

In [22]:
df = df.merge(transaction_metadata, on = "TransactionID", how = "left")

In [23]:
df.head(2)

,TransactionID,Amount,CustomerID,FraudIndicator,Timestamp,MerchantID
0,1,55.530334,1952,0,2022-01-01 00:00:00,2701
1,2,12.881180,1027,0,2022-01-01 01:00:00,2070

In [24]:
amount_data.head(2)

   TransactionID  TransactionAmount
0              1          79.413607
1              2          12.053087

In [25]:
df = df.merge(amount_data, on="TransactionID", how="left")

In [26]:
df.head(2)

,TransactionID,Amount,CustomerID,FraudIndicator,Timestamp,MerchantID,TransactionAmount
0,1,55.530334,1952,0,2022-01-01 00:00:00,2701,79.413607
1,2,12.881180,1027,0,2022-01-01 01:00:00,2070,12.053087

In [27]:
anomaly_scores.head(2)

   TransactionID  AnomalyScore
0              1      0.686699
1              2      0.081749

In [28]:
df = df.merge(anomaly_scores, on="TransactionID", how="left")

In [29]:
df.head(2)

,TransactionID,Amount,CustomerID,FraudIndicator,Timestamp,MerchantID,TransactionAmount,AnomalyScore
0,1,55.530334,1952,0,2022-01-01 00:00:00,2701,79.413607,0.686699
1,2,12.881180,1027,0,2022-01-01 01:00:00,2070,12.053087,0.081749

In [30]:
category_labels.head(2)

   TransactionID Category
0              1    Other
1              2   Online

In [31]:
df = df.merge(category_labels, on="TransactionID", how="left")

In [32]:
df.head(2)

,TransactionID,Amount,CustomerID,FraudIndicator,Timestamp,MerchantID,TransactionAmount,AnomalyScore,Category
0,1,55.530334,1952,0,2022-01-01 00:00:00,2701,79.413607,0.686699,Other
1,2,12.881180,1027,0,2022-01-01 01:00:00,2070,12.053087,0.081749,Online

## üß© Step 4 ‚Äî Merge merchant data (via MerchantID)

In [33]:
merchant_data.head(2)

   MerchantID   MerchantName       Location
0        2001  Merchant 2001  Location 2001
1        2002  Merchant 2002  Location 2002

In [34]:
df = df.merge(
    merchant_data,
    on="MerchantID",
    how="left"
)

In [35]:
df.head(2)

,TransactionID,Amount,CustomerID,FraudIndicator,Timestamp,MerchantID,TransactionAmount,AnomalyScore,Category,MerchantName,Location
0,1,55.530334,1952,0,2022-01-01 00:00:00,2701,79.413607,0.686699,Other,Merchant 2701,Location 2701
1,2,12.881180,1027,0,2022-01-01 01:00:00,2070,12.053087,0.081749,Online,Merchant 2070,Location 2070

## üß© Step 5 ‚Äî Merge customer data (via CustomerID)

In [36]:
customer_data.head(2)

   CustomerID           Name  Age       Address
0        1001  Customer 1001   54  Address 1001
1        1002  Customer 1002   35  Address 1002

In [37]:
df = df.merge(
    customer_data,
    on="CustomerID",
    how="left"
)

In [38]:
df.head(2)

,TransactionID,Amount,CustomerID,FraudIndicator,Timestamp,MerchantID,TransactionAmount,AnomalyScore,Category,MerchantName,Location,Name,Age,Address
0,1,55.530334,1952,0,2022-01-01 00:00:00,2701,79.413607,0.686699,Other,Merchant 2701,Location 2701,Customer 1952,50,Address 1952
1,2,12.881180,1027,0,2022-01-01 01:00:00,2070,12.053087,0.081749,Online,Merchant 2070,Location 2070,Customer 1027,46,Address 1027

## üß© Step 6 ‚Äî Merge customer behavior tables

In [39]:
account_activity.head(2)

   CustomerID  AccountBalance   LastLogin
0        1001     9507.272060  2022-01-01
1        1002     7408.704536  2022-01-02

In [40]:
df = df.merge(account_activity, on="CustomerID", how="left")

In [41]:
df.head(2)

,TransactionID,Amount,CustomerID,FraudIndicator,Timestamp,MerchantID,TransactionAmount,AnomalyScore,Category,MerchantName,Location,Name,Age,Address,AccountBalance,LastLogin
0,1,55.530334,1952,0,2022-01-01 00:00:00,2701,79.413607,0.686699,Other,Merchant 2701,Location 2701,Customer 1952,50,Address 1952,2869.689912,2024-08-09
1,2,12.881180,1027,0,2022-01-01 01:00:00,2070,12.053087,0.081749,Online,Merchant 2070,Location 2070,Customer 1027,46,Address 1027,9527.947107,2022-01-27

In [42]:
suspicious_activity.head(2)

   CustomerID  SuspiciousFlag
0        1001               0
1        1002               0

In [43]:
df = df.merge(suspicious_activity, on="CustomerID", how="left")

In [44]:
df.head(2)

,TransactionID,Amount,CustomerID,FraudIndicator,Timestamp,MerchantID,TransactionAmount,AnomalyScore,Category,MerchantName,Location,Name,Age,Address,AccountBalance,LastLogin,SuspiciousFlag
0,1,55.530334,1952,0,2022-01-01 00:00:00,2701,79.413607,0.686699,Other,Merchant 2701,Location 2701,Customer 1952,50,Address 1952,2869.689912,2024-08-09,0
1,2,12.881180,1027,0,2022-01-01 01:00:00,2070,12.053087,0.081749,Online,Merchant 2070,Location 2070,Customer 1027,46,Address 1027,9527.947107,2022-01-27,0

# STEP 1 ‚Äî Post-Merge Validation (MANDATORY), Validation check, if tables are correctly merge or not 

## `If any assert fails ‚Üí STOP and fix merge.`

## ‚úî Row count must NOT increase

In [45]:
assert df.shape[0] == transaction_records.shape[0], \
       "Row count changed after merge!"

df.shape[0] == transaction_records.shape[0]

True

## ‚úî TransactionID must stay unique

In [46]:
assert df["TransactionID"].is_unique, \
       "Duplicate TransactionIDs found!"

df["TransactionID"].is_unique

True

## ‚úî Check join issues

In [47]:
df.isnull().mean().sort_values(ascending=False)

TransactionID        0.0
MerchantName         0.0
LastLogin            0.0
AccountBalance       0.0
Address              0.0
Age                  0.0
Name                 0.0
Location             0.0
Category             0.0
Amount               0.0
AnomalyScore         0.0
TransactionAmount    0.0
MerchantID           0.0
Timestamp            0.0
FraudIndicator       0.0
CustomerID           0.0
SuspiciousFlag       0.0
dtype: float64

## ‚úî Target exists

In [48]:
assert df["FraudIndicator"].notna().all()